# DataFrame

In [8]:
import numpy as np

In [9]:
import pandas as pd

In [10]:
# import randn to generate random numbers
from numpy.random import randn

#### Create a DataFrame
Parameters pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)

In [11]:
# DataFrame with random numbers, 5 rows, 4 columns
df=pd.DataFrame(data=randn(5,4), index= ['a','b','c','d','e'], columns=['apple','orange','banana','mango'])
df

      apple    orange    banana     mango
a -2.152134 -0.062459 -0.057595 -2.659398
b -0.357584  0.654912 -1.083909 -1.604323
c  1.667731  1.732089 -0.167670 -0.736386
d  1.480926 -2.339357  1.084732  0.190094
e  0.879907  0.335050 -1.273007 -0.517827

#### how to grab any column, it return a Series

In [12]:
# First way:
df['apple']

a   -2.152134
b   -0.357584
c    1.667731
d    1.480926
e    0.879907
Name: apple, dtype: float64

In [13]:
#Second way:
df.apple

a   -2.152134
b   -0.357584
c    1.667731
d    1.480926
e    0.879907
Name: apple, dtype: float64

#### Grab multiple columns, it will return a DataFrame

In [14]:
df[['apple','mango']]

      apple     mango
a -2.152134 -2.659398
b -0.357584 -1.604323
c  1.667731 -0.736386
d  1.480926  0.190094
e  0.879907 -0.517827

#### Insert a new column, add two columns and add sum of values into new column

In [15]:
df['cherry']=df['apple']+df['orange']
df

      apple    orange    banana     mango    cherry
a -2.152134 -0.062459 -0.057595 -2.659398 -2.214593
b -0.357584  0.654912 -1.083909 -1.604323  0.297328
c  1.667731  1.732089 -0.167670 -0.736386  3.399820
d  1.480926 -2.339357  1.084732  0.190094 -0.858430
e  0.879907  0.335050 -1.273007 -0.517827  1.214956

#### Drop or delete any column
Note: By default, inplace=False, if you want a permanent change in DataFrame than it should be True

In [16]:
df.drop('mango',axis=1)

      apple    orange    banana    cherry
a -2.152134 -0.062459 -0.057595 -2.214593
b -0.357584  0.654912 -1.083909  0.297328
c  1.667731  1.732089 -0.167670  3.399820
d  1.480926 -2.339357  1.084732 -0.858430
e  0.879907  0.335050 -1.273007  1.214956

#### deleting any row

In [17]:
df.drop('a', axis=0)

      apple    orange    banana     mango    cherry
b -0.357584  0.654912 -1.083909 -1.604323  0.297328
c  1.667731  1.732089 -0.167670 -0.736386  3.399820
d  1.480926 -2.339357  1.084732  0.190094 -0.858430
e  0.879907  0.335050 -1.273007 -0.517827  1.214956

#### Selecting rows using loc( ) and iloc( ) method.

In [18]:
# it will return series
df.loc['a']

apple    -2.152134
orange   -0.062459
banana   -0.057595
mango    -2.659398
cherry   -2.214593
Name: a, dtype: float64

In [19]:
# multiple rows return Dataframe
df.loc[['a','b']]

      apple    orange    banana     mango    cherry
a -2.152134 -0.062459 -0.057595 -2.659398 -2.214593
b -0.357584  0.654912 -1.083909 -1.604323  0.297328

In [20]:
# We could also grab a specific item in the DataFrame, e.g row = d , column = mango.
df.loc['d','mango']

0.19009382713406933

In [39]:
# get a subset, rows = a & b, columns = mango and cherry
df.loc[['a','b'],['mango','cherry']]

      mango    cherry
a -2.659398 -2.214593
b -1.604323  0.297328

In [22]:
# iloc() select index location, e.g select 'd'
df.iloc[3]

apple     1.480926
orange   -2.339357
banana    1.084732
mango     0.190094
cherry   -0.858430
Name: d, dtype: float64

In [23]:
# We could also grab a specific item in the DataFrame, e.g row = 3, column = 2.
df.iloc[3,2]

1.0847322110800748

In [24]:
# get a subset, rows = 1 & 2, columns = 0 & 1
df.iloc[[1,2],[0,1]]

      apple    orange
b -0.357584  0.654912
c  1.667731  1.732089

# Conditional Operations

In [25]:
df

      apple    orange    banana     mango    cherry
a -2.152134 -0.062459 -0.057595 -2.659398 -2.214593
b -0.357584  0.654912 -1.083909 -1.604323  0.297328
c  1.667731  1.732089 -0.167670 -0.736386  3.399820
d  1.480926 -2.339357  1.084732  0.190094 -0.858430
e  0.879907  0.335050 -1.273007 -0.517827  1.214956

#### show values which are greater than 0, return boolean values.

In [26]:
df>0

   apple  orange  banana  mango  cherry
a  False   False   False  False   False
b  False    True   False  False    True
c   True    True   False  False    True
d   True   False    True   True   False
e   True    True   False  False    True

In [27]:
# we can apply condition on only one column, will return boolean
df['apple']>0

a    False
b    False
c     True
d     True
e     True
Name: apple, dtype: bool

In [28]:
# Another way of doing above and also display addition columns such as banana and mango, return positive rows with
#respect of 'apple'.
df[df['apple']>0][['banana','mango']]

     banana     mango
c -0.167670 -0.736386
d  1.084732  0.190094
e -1.273007 -0.517827

In [29]:
# we can get the whole DataFrame back but only apply condition to only one column, e.g 'apple, return only True rows.
df[df['apple']>0]

      apple    orange    banana     mango    cherry
c  1.667731  1.732089 -0.167670 -0.736386  3.399820
d  1.480926 -2.339357  1.084732  0.190094 -0.858430
e  0.879907  0.335050 -1.273007 -0.517827  1.214956

In [30]:
df[df>0]

      apple    orange    banana     mango    cherry
a       NaN       NaN       NaN       NaN       NaN
b       NaN  0.654912       NaN       NaN  0.297328
c  1.667731  1.732089       NaN       NaN  3.399820
d  1.480926       NaN  1.084732  0.190094       NaN
e  0.879907  0.335050       NaN       NaN  1.214956

### Multiple Conditions 
##### Show all values greater than 0 in column 'apple' and 'mango'

In [31]:
# Both conditions should be true
df[(df['apple']>0) & (df['mango']>0)]

      apple    orange    banana     mango   cherry
d  1.480926 -2.339357  1.084732  0.190094 -0.85843

##### Show all values greater than 0 in column 'apple' or 'mango'

In [32]:
# this will return all the values in both columns which are greater than 0.
df[(df['apple']>0) | (df['mango']>0)]

      apple    orange    banana     mango    cherry
c  1.667731  1.732089 -0.167670 -0.736386  3.399820
d  1.480926 -2.339357  1.084732  0.190094 -0.858430
e  0.879907  0.335050 -1.273007 -0.517827  1.214956

### Reset index
##### Index becomes a new column

In [33]:
df

      apple    orange    banana     mango    cherry
a -2.152134 -0.062459 -0.057595 -2.659398 -2.214593
b -0.357584  0.654912 -1.083909 -1.604323  0.297328
c  1.667731  1.732089 -0.167670 -0.736386  3.399820
d  1.480926 -2.339357  1.084732  0.190094 -0.858430
e  0.879907  0.335050 -1.273007 -0.517827  1.214956

In [34]:
df.reset_index()

  index     apple    orange    banana     mango    cherry
0     a -2.152134 -0.062459 -0.057595 -2.659398 -2.214593
1     b -0.357584  0.654912 -1.083909 -1.604323  0.297328
2     c  1.667731  1.732089 -0.167670 -0.736386  3.399820
3     d  1.480926 -2.339357  1.084732  0.190094 -0.858430
4     e  0.879907  0.335050 -1.273007 -0.517827  1.214956

#### insert new column and set it as index

In [35]:
# Step 1, make a list.
new_index=['CA','AZ','CO','NY','OR']

In [36]:
# Step 2, add a new columns
df['States']=new_index
df

      apple    orange    banana     mango    cherry States
a -2.152134 -0.062459 -0.057595 -2.659398 -2.214593     CA
b -0.357584  0.654912 -1.083909 -1.604323  0.297328     AZ
c  1.667731  1.732089 -0.167670 -0.736386  3.399820     CO
d  1.480926 -2.339357  1.084732  0.190094 -0.858430     NY
e  0.879907  0.335050 -1.273007 -0.517827  1.214956     OR

In [37]:
# Step 3, replace new column with the index
df.set_index('States')

           apple    orange    banana     mango    cherry
States
CA     -2.152134 -0.062459 -0.057595 -2.659398 -2.214593
AZ     -0.357584  0.654912 -1.083909 -1.604323  0.297328
CO      1.667731  1.732089 -0.167670 -0.736386  3.399820
NY      1.480926 -2.339357  1.084732  0.190094 -0.858430
OR      0.879907  0.335050 -1.273007 -0.517827  1.214956